/* ********************************************************************* 
       _____        _               _    ___ ____   ____
      |_   _|___  _| |_ _   _  __ _| |  |_ _|  _ \ / ___|
       | |/ _ \ \/ / __| | | |/ _` | |   | || |_) | |
       | |  __/>  <| |_| |_| | (_| | |   | ||  _ <| |___
       |_|\___/_/\_\\__|\__,_|\__,_|_|  |___|_| \_\\____|

 Copyright (c) 2010 — 2013 Codeux Software & respective contributors.
        Please see Contributors.pdf and Acknowledgements.pdf

 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions
 are met:

    * Redistributions of source code must retain the above copyright
      notice, this list of conditions and the following disclaimer.
    * Redistributions in binary form must reproduce the above copyright
      notice, this list of conditions and the following disclaimer in the
      documentation and/or other materials provided with the distribution.
    * Neither the name of the Textual IRC Client & Codeux Software nor the
      names of its contributors may be used to endorse or promote products
      derived from this software without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
 ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
 FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 SUCH DAMAGE.

 *********************************************************************** */

"AboutWindowBuildNumber" = "Version %@";

"AccessibilityMemberListDescription" = "User %1$@ selected in member list of channel hash %2$@.";

"AddressBookIgnoreEntryType" = "User Ignore";
"AddressBookUserTrackingEntryType" = "User Tracking";

"ApplicationWantsToTerminatePromptMessage" = "Quitter va vous déconnecter de tous les serveurs IRC auxquels vous êtes connectés jusqu'à ce que vous redémarriez Textual.";
"ApplicationWantsToTerminatePromptTitle" = "Voulez-vous quitter Textual ?";

"BlowfishEncryptionFailed" = "Encryption of message failed. Not sending to server.";
"BlowfishEncryptionKeyChanged" = "Encryption key changed. Adjusting accordingly.";
"BlowfishEncryptionStarted" = "Encryption started.";
"BlowfishEncryptionStopped" = "Encryption stopped.";

"ConnectToSupportChannelQuestionDialogTitle" = "Connexion au canal du support";
"ConnectToSupportChannelQuestionDialogMessage" = "Le canal IRC du support du client Textual IRC est situé sur le réseau Freenode. Voulez-vous ajouter ce canal ?";

"CancelButton" = "Annuler";

"ChannelApplicationTitleModeValue" = " (%@)";
"ChannelApplicationTitleUserCount" = " (%ld Users)";

"ChannelDeletePromptMessage" = "There is no undo and all data related to this channel, except for logs, will be erased.";
"ChannelDeletePromptTitle" = "Voulez-vous supprimer la sélection ?";

"ChannelListNetworkName" = "Liste des canaux pour \"%@\"";

"CloseButton" = "Fermer";

"CmdWShortcutClosePrivateMessageType" = "Fermer la requête";
"CmdWShortcutCloseWindowType" = "Fermer la fenêtre";
"CmdWShortcutDisconnectServerType" = "Disconnect from %@";
"CmdWShortcutLeaveChannelType" = "Quitter le canal";
"CmdWShortcutQuitApplicationType" = "Quitter Textual & IRC";

"ContinueButton" = "Continuer";

"CopyLogAsHTMLMenuItem" = "Copy Log as HTML";

"DCCRequestErrorMessage" = "The Textual IRC Client has received a DCC request that could not be processed.";

"DefaultDisconnectQuitMessage" = "Textual IRC Client: www.textualapp.com";
"DefaultNewConnectionName" = "Untitled Connection";

"DeleteButton" = "Supprimer";

"DeleteChannelMenuItem" = "Supprimer le canal";
"DeletePrivateMessageMenuItem" = "Fermer la requête";

"FindSearchPanelPromptButton" = "Search";
"FindSearchPanelPromptMessage" = "Enter a phrase to search for. Once a search is created, the keyboard shortcut ⌘G can be used to continue to the next search result and the combination ⌘⇧G to return to the previous.";
"FindSearchPanelPromptTitle" = "Search for Message";

"ForceReloadThemeMenuItem" = "Force Reload Style";

"GlineReason" = "35d Your behavior is not conducive to the desired environment.";

"ExcessFloodIRCDisconnectAlertTitle" = "Excess Flood";
"ExcessFloodIRCDisconnectAlertMessage" = "A disconnection has occured due to excess flood. Reconnect?";
"ExcessFloodIRCDisconnectAlertOpenFloodControlButton" = "Configure Flood Control";

"IRCCTCPVersionInfoBasic" = "%1$@ %2$@ (Flavor: %4$@)";

"IRCCTCPVersionInfoDetailed_1" = "%1$@ %2$@ (Build #%3$@)";
"IRCCTCPVersionInfoDetailed_2" = "%1$@ %2$@ (Git Reference: %3$@) (Flavor: %4$@)";

"IRCAwayCommandDefaultReason" = "Be back later.";
"IRCCTCPRequestIgnored" = "\002-CTCP-\002 %1$@ from %2$@ was ignored.";
"IRCCTCPSupportedReplies" = "VERSION CLIENTINFO USERINFO PING TIME";
"IRCCTCPVersionTitle" = "\002Current Version:\002 %@";
"IRCCapCurrentlyEnabledNone" = "There are no capabilities in use.";
"IRCCapCurrentlyEnbaled" = "The following capabilities are currently enabled: %@";
"IRCChannelEmptyTopic" = "(No Topic)";
"IRCChannelHasModes" = "Mode is \002%@\002";
"IRCChannelHasTopic" = "Topic is \002%@\002";
"IRCChannelHasTopicAuthor" = "Set by \002%1$@\002 on %2$@";
"IRCChannelHasWebsite" = "Website is \002%@\002";
"IRCChannelPreparingRejoinAttempt" = "Attempting to rejoin channel in three seconds.";
"IRCChannelTopicChanged" = "\002%1$@\002 changed the topic to \002%2$@\002";
"IRCConnectedToServer" = "Connection to host completed.";
"IRCDisconnectedBySleepMode" = "Disconnect for Sleep Mode";
"IRCDisconnectedByBadSSLCertificate" = "Disconnected from server because of an untrusted SSL certificate.";
"IRCDisconnectedByTimeout" = "%ld minutes have elapsed since last response from this connection. Disconnecting due to timeout.";
"IRCDisconnectedByTrialPeriodTimer" = "Disconnected from server due to trial period limit. Please consider purchasing Textual to continue or simply reconnect.";
"IRCDisconnectedFromServer" = "Déconnecté";
"IRCHadRawError" = "Message(%1$d): %2$@";
"IRCIsConnecting" = "Connecting to [%1$@] on port %2$ld";
"IRCIsConnectingWithNormalProxy" = "Connecting to [%1$@, port %2$ld] via [%3$@, port %4$ld]";
"IRCIsConnectingWithSystemProxy" = "Connecting to [%1$@, port %2$ld] via System Socks";
"IRCIsReconnecting" = "Reconnexion …";
"IRCIsRetryingConnection" = "Retrying …";
"IRCModeSet" = "\002%1$@\002 sets mode \002%2$@\002";
"IRCRawModeIsDisabled" = "Raw mode has been disabled. Textual will no longer output raw data.";
"IRCRawModeIsEnabled" = "Raw mode has been enabled. Textual will now output all data that it receives from and sends to the IRC server in the Mac OS X \"Console\" application. To disable, execute \"/debug raw off\"";
"IRCRecievedCTCPPingReply" = "\002-%1$@ CTCP-\002 %2$@ (%3$1.5f sec)";
"IRCRecievedCTCPReply" = "\002-%1$@ CTCP-\002 %2$@ %3$@";
"IRCRecievedCTCPRequest" = "\002-CTCP-\002 %1$@ from %2$@";
"IRCServerHadNetsplitQuitMessage" = "Netsplit: %@";
"IRCServerNetworkName" = "%@ IRC Network";
"IRCTimerCommandRequiresInteger" = "Timer command requires number for interval. Syntax: \"/timer <seconds> <command>\"";
"IRCUserChangedNickname" = "%1$@ is now known as \002%2$@\002";
"IRCUserDisconnected" = "\002%1$@\002 (%2$@@%3$@) left IRC.";
"IRCUserHasModes" = "Votre mode d'utilisateur est %@";
"IRCUserInvitedToJoinChannel" = "Inviting %1$@ to join %2$@";
"IRCUserInvitedYouToJoinChannel" = "%1$@!%2$@@%3$@ invited you to join %4$@";
"IRCUserIsAway" = "%1$@ is away (%2$@)";
"IRCUserIsNowIRCOperator" = "You are now an IRC Operator on %@";
"IRCUserJoinedChannel" = "\002%1$@\002 (%2$@@%3$@) joined the channel.";
"IRCUserKickedFromChannel" = "\002%1$@\002 kicked \002%2$@\002 from the channel. (%3$@)";
"IRCUserPartedChannel" = "\002%1$@\002 (%2$@@%3$@) left the channel.";
"IRCUserWhoisChannels" = "%1$@ is on %2$@";
"IRCUserWhoisConnectedFrom" = "%1$@ is connected on %2$@ (%3$@)";
"IRCUserWhoisHostmask" = "%1$@ has userhost %2$@@%3$@ and real name \"%4$@\"";
"IRCUserWhoisUptime" = "%1$@ signed on at %2$@ and has been idle for %3$@";
"IRCUserWhowasConnectedFrom" = "%1$@ was connected to %2$@ on %3$@";
"IRCUserWhowasHostmask" = "%1$@ had userhost %2$@@%3$@ and real name \"%4$@\"";

"InputRequiredToContinue" = "Input Required to Continue";

"InputTextFieldPlaceholderValue" = "Send Message …";

"InviteSheetMultiplePeopleSelected" = "%d users";
"InviteSheetTargetDescription" = "Invite %@ to:";
"InviteSheetTwoPeopleSelected" = "%1$@ and %2$@";

"KickReason" = "Your behavior is not conducive to the desired environment.";
"KillReason" = "Your behavior is not conducive to the desired environment.";

"LoadedPlguinsCommandLoadedBundles" = "Loaded Bundles: %@";
"LoadedPlguinsCommandLoadedScripts" = "Loaded Scripts: %@";
"LoadedPlguinsCommandNothingLoaded" = "Nothing loaded.";

"LagCheckRequestReplyMessage" = "Received lag check reply from %1$@. Time elapsed: %2$1.5f seconds. (Rating: %3$@)";
"LagCheckRequestSentMessage" = "Waiting for response from lag check …";
"LagCheckRequestUnknownReply" = "Received lag check reply even though we never sent a request for one. Exploit attempt?";

"LagCheckRequestReplyRating_00" = "Yeah, okay…";
"LagCheckRequestReplyRating_01" = "Are you plugged into the server?";
"LagCheckRequestReplyRating_02" = "Almost No Lag.";
"LagCheckRequestReplyRating_03" = "Very Fast.";
"LagCheckRequestReplyRating_04" = "Fast.";
"LagCheckRequestReplyRating_05" = "Average.";
"LagCheckRequestReplyRating_06" = "Slow.";
"LagCheckRequestReplyRating_07" = "Very Slow.";
"LagCheckRequestReplyRating_08" = "Dang! Call your ISP.";
"LagCheckRequestReplyRating_09" = "You Fail! (www.youfail.org)";

"ListDialogHasChannels" = "%ld Public Channels";
"ListDialogHasSearchResults" = "%1$ld Public Channels - %2$ld Search Results";

"LogPathDoesNotExistMessage" = "No logs were found for this chat session.";
"LogPathDoesNotExistTitle" = "No Logs Found";

"NoLogLocationDefinedMenuItem" = "No Log Location Selected";

"LogFileBeginOfSessionHeader" = "————————————— Begin Session —————————————";
"LogFileEndOfSessionHeader" = "————————————— End Session —————————————";

/* OldSandboxContainerFoundDialog* messages are actually not used in Textual 
 as of the time that this comment was written. It used to be during beta testing
 of an older version of Textual. It is being kept around in case it is needed again. */
"OldSandboxContainerFoundDialogTitle" = "Migration Assistant";
"OldSandboxContainerFoundDialogMessage" = "A set of configuration files associated with an earlier version of Textual have been found.\n\nTextual does not have permission to move the old files while within the Mac OS Sandbox so please download our migration assistant to move them into the correct location.";
"OldSandboxContainerFoundDialogPrimaryButton" = "Quit & Download Assistant";
"OldSandboxContainerFoundDialogSecondaryButton" = "Do Not Download";

"NoButton" = "No";

/* If an event is not defined below for spoken events, then the odds are
 good that the text to be spoken is localized somewhere else. For example,
 the address book event type is defined near the end of this file. */
"NotificationChannelMessageSpokenMessage"		= "Channel Message in %1$@ by %2$@, %3$@";
"NotificationChannelNoticeSpokenMessage"		= "Channel Notice in %1$@ by %2$@, %3$@";
"NotificationHighlightSpokenMessage"			= "Highlight in %1$@ by %2$@, %3$@";
"NotificationInvitedSpokenMessage"				= "Invited to %1$@ by %2$@";
"NotificationKickedSpokenMessage"				= "Kicked from %1$@ by %2$@";
"NotificationNewPrivateMessageSpokenMessage"	= "New Private Message from %1$@, %2$@";
"NotificationPrivateMessageSpokenMessage"		= "Private Message from %1$@, %2$@";
"NotificationPrivateNoticeSpokenMessage"		= "Private Notice from %1$@, %2$@";
"NotificationConnectedSpokenMessage"			= "Connected to %@";
"NotificationDisconnectSpokenMessage"			= "Disconnected from %@";

"NotificationAddressBookMatchMessageTitle"	= "Address Book Notification";
"NotificationChannelMessageMessageTitle"	= "Channel Message: %@";
"NotificationChannelNoticeMessageTitle"		= "Channel Notice: %@";
"NotificationConnectedMessageTitle"			= "Connected: %@";
"NotificationDisconnectMessageTitle"		= "Disconnected: %@";
"NotificationHighlightMessageTitle"			= "Highlight: %@";
"NotificationInvitedMessageTitle"			= "Invited: %@";
"NotificationKickedMessageTitle"			= "Kicked: %@";
"NotificationNewPrivateMessageMessageTitle"	= "New Private Message";
"NotificationPrivateMessageMessageTitle"	= "Private Message";
"NotificationPrivateNoticeMessageTitle"		= "Private Notice";

"NotificationConnectedMessageDescription"	= "Connection successful.";
"NotificationDisconnectMessageDescription"	= "Disconnection successful.";
"NotificationInvitedMessageDescription"		= "%1$@ has invited you to %2$@";
"NotificationKickedMessageDescription"		= "%1$@ has kicked you out: %2$@";

"OSXGoingToSleepQuitMessage" = "My %@ has gone to sleep. ZZZzzz…";

"OkButton" = "OK";

"OpeningLocalStyleResourcesCopyButton" = "Make Local Copy";
"OpeningLocalStyleResourcesMessage" = "The style being opened is a read-only version bundled with Textual.";
"OpeningLocalStyleResourcesTitle" = "Resource Files";

"PluginCommandClashErrorMessage" = "Error: The command %@ is shared by both a script and plugin. Sending to server because of inability to determine priority.";

"PromptSuppressionButtonDefaultTitle" = "Do not show this message again";

"QuitButton" = "Quit";

"ScriptExecutionFailureBasic" = "Script Execution Failure: %@";
"ScriptExecutionFailureDetailed" = "Script Execution Failure (%1$@: %2$@): %3$@";

"SelfBanDetectedMessage" = "Textual has prevented you from banning yourself on %@.";

"ServerDeletePromptMessage" = "There is no undo and all data related to this server, except for logs, will be erased.";
"ServerDeletePromptTitle" = "Voulez-vous supprimer la sélection ?";

"ServerNotConnectedLineSendError" = "Failed to send data to server. Not connected.";

"ServerNoticeTreeItemTitle"	= "Server Notices";

"ServerSheetAutojoinNavigationTreeItem"	= "Autojoin";
"ServerSheetCommandsNavigationTreeItem"	= "Connect Commands";
"ServerSheetEncodingNavigationTreeItem"	= "Encoding";
"ServerSheetFloodControlNavigationTreeItem"	= "Flood Control";
"ServerSheetGeneralNavigationTreeItem" = "General";
"ServerSheetIdentityNavigationTreeItem"	= "Identity";
"ServerSheetIgnoresNavigationTreeItem" = "Address Book";
"ServerSheetMessageNavigationTreeItem" = "Messages";
"ServerSheetMiscNavigationTreeItem" = "Miscellaneous";
"ServerSheetProxyNavigationTreeItem" = "Proxy Server";

"SetAsDefaultIRCClientPromptMessage" = "Textual is not set as the default IRC client for this copy of Mac OS X. Set it?";
"SetAsDefaultIRCClientPromptTitle" = "Default IRC Client";

"SetUserVhostPromptMessage"	= "Please enter desired vHost. (e.g. apple.vhost)";
"SetUserVhostPromptTitle" = "Set User vHost";

"ShunReason" = "1d Shunned.";

"SocketBadSSLCertificateErrorMessage" = "The server that you are connecting to has a SSL certificate that has either expired or is not trusted. Would you like to connect to the server regardless?";
"SocketBadSSLCertificateErrorTitle" = "Untrusted Connection";

"SoundIsAlreadyMuted" = "Sound is already muted.";
"SoundIsNoLongerMuted" = "Sound is no longer muted. ";
"SoundIsNotMuted" = "Sound is not muted.";
"SoundIsNowMuted" = "Sound has been muted.";

"StyleTemplateLoadFailed" = "Template Load Failed: %@";

"TXEmptySoundAlertLabel" = "None";

"TXNotificationAddressBookMatchType"	= "Address Book Notification";
"TXNotificationChannelMessageType"		= "Channel Message";
"TXNotificationChannelNoticeType"		= "Channel Notice";
"TXNotificationConnectType"				= "Connected";
"TXNotificationDisconnectType"			= "Déconnecté";
"TXNotificationHighlightType"			= "Highlight";
"TXNotificationInviteType"				= "Channel Invitation";
"TXNotificationKickType"				= "Kicked from Channel";
"TXNotificationNewPrivateMessageType"	= "Private Message (new)";
"TXNotificationPrivateMessageType"		= "Private Message";
"TXNotificationPrivateNoticeType"		= "Private Notice";

"ThemeChangeOverridePromptChannelFont" = "• Channel View Font";
"ThemeChangeOverridePromptMessage" = "The newly selected style \"%1$@\" has chosen to override the following preferences with ones that it prefers for the best viewing experience:\n\n%2$@";
"ThemeChangeOverridePromptNicknameFormat" = "• Nickname Format";
"ThemeChangeOverridePromptTimestampFormat" = "• Timestamp Format";
"ThemeChangeOverridePromptWindowColors" = "• Window Colors";
"ThemeChangeOverridePromptTitle" = "Preferred Selection";

"TimeIntervalSinceFirstCommit" = "\002Time Since First Commit:\002 %@";

"TimeAgo" = "%@ Ago";

"TimeConvertPlural[DAY]" = "Days";
"TimeConvertPlural[HOUR]" = "Hours";
"TimeConvertPlural[MINUTE]" = "Minutes";
"TimeConvertPlural[MONTH]" = "Months";
"TimeConvertPlural[SECOND]" = "Seconds";
"TimeConvertPlural[WEEK]" = "Weeks";
"TimeConvertPlural[YEAR]" = "Years";

"TimeConvert[DAY]" = "Day";
"TimeConvert[HOUR]" = "Hour";
"TimeConvert[MINUTE]" = "Minute";
"TimeConvert[MONTH]" = "Month";
"TimeConvert[SECOND]" = "Second";
"TimeConvert[WEEK]" = "Week";
"TimeConvert[YEAR]" = "Year";

"TrustButton" = "Trust";

"Unknown" = "Unknown";

"UserHostmaskHoverTooltipMode_NA" = "No Privileges";
"UserHostmaskHoverTooltipMode_V" = "Voice";
"UserHostmaskHoverTooltipMode_H" = "Half-op";
"UserHostmaskHoverTooltipMode_O" = "Operator";
"UserHostmaskHoverTooltipMode_A" = "Super Admin";
"UserHostmaskHoverTooltipMode_Q" = "Channel Owner";
"UserHostmaskHoverTooltipMode_IRCop" = " — Server Staff Member";
"UserHostmaskHoverTooltipNoInfo" = "Information Not Available";

"UserTrackingHostmaskConnected" = "User with hostmask \"%1$@\" matching Address Book entry \"%2$@\" connected.";
"UserTrackingHostmaskNoLongerAvailable" = "User with hostmask \"%1$@\" matching Address Book entry \"%2$@\" is no longer available.";
"UserTrackingHostmaskNowAvailable" = "User with hostmask \"%1$@\" matching Address Book entry \"%2$@\" is now available.";

"UserTrackingNicknameIsAvailable" = "User with nickname \"%1$@\" matching Address Book entry \"%2$@\" is available.";
"UserTrackingNicknameNoLongerAvailable" = "User with nickname \"%1$@\" matching Address Book entry \"%2$@\" is no longer available.";
"UserTrackingNicknameNowAvailable" = "User with nickname \"%1$@\" matching Address Book entry \"%2$@\" is now available.";

"YesButton" = "Yes";
